{
  "post": [
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/01/2022, 12:00 AM.",
      "postContent": "Good evening, everyone! Like other months before, this will be the very first announcement of August! I am looking forward to what improvements can be made to this website!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 1
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/01/2022, 12:00 AM.",
      "postContent": "That will be everything for the evening. Thank you and have a wonderful evening and great rest of the day!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 2
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/05/2022, 02:34 PM.",
      "postContent": "Good afternoon, everyone. I am writing this to announce that I made a few upgrades when saving changes in the 'Settings' page. When clicking the 'Save' button without actually making any changes to it will return an error message saying that you have to make them before clicking on the Save button once more.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 3
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/05/2022, 02:34 PM.",
      "postContent": "In addition, when making the change and selecting the original setting that was either pre-configured by default or by yourself, the Save button will be disabled until you select a different one.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 4
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/05/2022, 02:34 PM.",
      "postContent": "That's all I wanted to announce for today, as it is only a change to the way the Save button works when, again, making changes to the settings in the 'Settings' page. Thank you and have a wonderful weekend, y'all!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 5
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/13/2022, 02:01 PM.",
      "postContent": "Good afternoon, y'all! Since last night, I made a few tweaks to the website. One of these features includes adding an automatic redirect feature that will take you back to a previous page in 5 seconds if y'all ended up in the Error 404 page.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 6
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/13/2022, 02:01 PM.",
      "postContent": "In other news, I have been gone for over a week, mainly due to college. Since I am about to approach the end of my semester, I will only have a week left of break before the new Fall semester starts at the end of the month. That means I will try to make any necessary changes and bug fixes that affect this website.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 7
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/13/2022, 02:01 PM.",
      "postContent": "That will be it for today. I hope you all have a wonderful weekend, and please stay safe, everyone!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 8
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/14/2022, 04:11 PM.",
      "postContent": "Good afternoon. I am writing this to announce that I have made a few changes to the progress countdown section in the 'About Me' page. Some of these changes include fixing when the counter should update, as well as upgrading the design of the progress countdown feature itself.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 9
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/14/2022, 04:11 PM.",
      "postContent": "More fixes will be included in the next week or the following week, with more focus being put in how long has it been since the previous update, as the section does not take minutes into consideration.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 10
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/14/2022, 04:11 PM.",
      "postContent": "I'll let y'all know when it is ready so that way, everything comes out the way it is supposed to. There will still be bugs, but at a reduced level. That is everything for today. Thank y'all for your patience and have a wonderful Sunday!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 11
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/22/2022, 04:07 AM.",
      "postContent": "Good morning everyone! I am writing this post to let y'all know that I am done for the summer semester. I will only have one week of break before the fall semester starts. During this time, I will continue to make updates to this site as much as I can. I will still be able to make these changes to the site during the fall semester, but because since it is my last year, I will have to put most of my focus on developing a senior project, as well as maintaining my grades to make sure I do not fall behind.",
      "month": 8,
      "date": 22,
      "year": 2022,
      "id": 12
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/22/2022, 04:10 AM.",
      "postContent": "Apart from that, everything should go well! I hope to continue to post daily announcements on this site with whatever free time I can make during my last two upcoming semesters, which will definitely cause me to be busier.",
      "month": 8,
      "date": 22,
      "year": 2022,
      "id": 13
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/22/2022, 04:12 AM.",
      "postContent": "I hope to see you all soon! Have a wonderful day and please stay safe y'all!",
      "month": 8,
      "date": 22,
      "year": 2022,
      "id": 14
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/24/2022, 11:00 AM.",
      "postContent": "Good morning, everyone! I am writing this announcement to let y'all know that in a week, this month's announcements will be archived on September 1, 12:00 AM. Simultaneously, the posts for the new month will appear after August's posts have been archived.",
      "month": 8,
      "date": 24,
      "year": 2022,
      "id": 15
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 08/24/2022, 11:01 AM.",
      "postContent": "That will be all for the announcements for today. I hope you all have a wonderful rest of the day!",
      "month": 8,
      "date": 24,
      "year": 2022,
      "id": 16
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/26/2022, 06:13 PM.",
      "postContent": "Good evening, everyone. A few days ago, I left an update message saying that I was going to be taking a break for the rest of the week until August 29.",
      "month": 8,
      "date": 26,
      "year": 2022,
      "id": 17
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/26/2022, 06:15 PM.",
      "postContent": "The message will be on display until August 29 at 6 AM in the morning. During that same week, I will be a little bit busy adjusting to the new fall semester in addition to dealing with the resulting workload.",
      "month": 8,
      "date": 26,
      "year": 2022,
      "id": 18
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/26/2022, 06:17 PM.",
      "postContent": "This will be my the last announcement for the week. Before I conclude, I wanted to remind y'all at the end of the month, this month's announcements will be archived on September 1 at 12 AM, per the archival process that occurs every month.",
      "month": 8,
      "date": 26,
      "year": 2022,
      "id": 19
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/26/2022, 06:22 PM.",
      "postContent": "That will be it for today. Thank you all for your patience, and have a wonderful weekend!",
      "month": 8,
      "date": 26,
      "year": 2022,
      "id": 20
    }
  ]
}