{
  "post": [
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/1/2022, 12:00 AM.",
      "postContent": "Good evening, everyone! Like other months before, this will be the very first announcement of August! I am looking forward to what improvements can be made to this website!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 1
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/1/2022, 12:00 AM.",
      "postContent": "That will be everything for the evening. Thank you and have a wonderful evening and great rest of the day!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 2
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/5/2022, 02:34 PM.",
      "postContent": "Good afternoon, everyone. I am writing this to announce that I made a few upgrades when saving changes in the 'Settings' page. When clicking the 'Save' button without actually making any changes to it will return an error message saying that you have to make them before clicking on the Save button once more.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 3
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/5/2022, 02:34 PM.",
      "postContent": "In addition, when making the change and selecting the original setting that was either pre-configured by default or by yourself, the Save button will be disabled until you select a different one.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 4
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/5/2022, 02:34 PM.",
      "postContent": "That's all I wanted to announce for today, as it is only a change to the way the Save button works when, again, making changes to the settings in the 'Settings' page. Thank you and have a wonderful weekend, y'all!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 5
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/13/2022, 02:01 PM.",
      "postContent": "Good afternoon, y'all! Since last night, I made a few tweaks to the website. One of these features includes adding an automatic redirect feature that will take you back to a previous page in 5 seconds if y'all ended up in the Error 404 page.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 6
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/13/2022, 02:01 PM.",
      "postContent": "In other news, I have been gone for over a week, mainly due to college. Since I am about to approach the end of my semester, I will only have a week left of break before the new Fall semester starts at the end of the month. That means I will try to make any necessary changes and bug fixes that affect this website.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 7
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/13/2022, 02:01 PM.",
      "postContent": "That will be it for today. I hope you all have a wonderful weekend, and please stay safe, everyone!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 8
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/14/2022, 04:11 PM.",
      "postContent": "Good afternoon. I am writing this to announce that I have made a few changes to the progress countdown section in the 'About Me' page. Some of these changes include fixing when the counter should update, as well as upgrading the design of the progress countdown feature itself.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 9
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/14/2022, 04:11 PM.",
      "postContent": "More fixes will be included in the next week or the following week, with more focus being put in how long has it been since the previous update, as the section does not take minutes into consideration.",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 10
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/14/2022, 04:11 PM.",
      "postContent": "I'll let y'all know when it is ready so that way, everything comes out the way it is supposed to. There will still be bugs, but at a reduced level. That is everything for today. Thank y'all for your patience and have a wonderful Sunday!",
      "month": 8,
      "date": 21,
      "year": 2022,
      "id": 11
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/22/2022, 04:07 AM.",
      "postContent": "Good morning everyone! I am writing this post to let y'all know that I am done for the summer semester. I will only have one week of break before the fall semester starts. During this time, I will continue to make updates to this site as much as I can. I will still be able to make these changes to the site during the fall semester, but because since it is my last year, I will have to put most of my focus on developing a senior project, as well as maintaining my grades to make sure I do not fall behind.",
      "month": 8,
      "date": 22,
      "year": 2022,
      "id": 12
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/22/2022, 04:10 AM.",
      "postContent": "Apart from that, everything should go well! I hope to continue to post daily announcements on this site with whatever free time I can make during my last two upcoming semesters, which will definitely cause me to be busier.",
      "month": 8,
      "date": 22,
      "year": 2022,
      "id": 13
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/22/2022, 04:12 AM.",
      "postContent": "I hope to see you all soon! Have a wonderful day and please stay safe y'all!",
      "month": 8,
      "date": 22,
      "year": 2022,
      "id": 14
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/24/2022, 11:00 AM.",
      "postContent": "Good morning, everyone! I am writing this announcement to let y'all know that in a week, this month's announcements will be archived on September 1, 12:00 AM. Simultaneously, the posts for the new month will appear after August's posts have been archived.",
      "month": 8,
      "date": 24,
      "year": 2022,
      "id": 15
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/24/2022, 11:01 AM.",
      "postContent": "That will be all for the announcements for today. I hope you all have a wonderful rest of the day!",
      "month": 8,
      "date": 24,
      "year": 2022,
      "id": 16
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/26/2022, 06:13 PM.",
      "postContent": "Good evening, everyone. A few days ago, I left an update message saying that I was going to be taking a break for the rest of the week until August 29.",
      "month": 8,
      "date": 26,
      "year": 2022,
      "id": 17
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/26/2022, 06:15 PM.",
      "postContent": "The message will be on display until August 29 at 6 AM in the morning. During that same week, I will be a little bit busy adjusting to the new fall semester in addition to dealing with the resulting workload.",
      "month": 8,
      "date": 26,
      "year": 2022,
      "id": 18
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/26/2022, 06:17 PM.",
      "postContent": "This will be my the last announcement for the week. Before I conclude, I wanted to remind y'all at the end of the month, this month's announcements will be archived on September 1 at 12 AM, per the archival process that occurs every month.",
      "month": 8,
      "date": 26,
      "year": 2022,
      "id": 19
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/26/2022, 06:22 PM.",
      "postContent": "That will be it for today. Thank you all for your patience, and have a wonderful weekend!",
      "month": 8,
      "date": 26,
      "year": 2022,
      "id": 20
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/31/2022, 11:21 AM.",
      "postContent": "Good morning, everyone! This will be the last announcement for this month. At 12 AM on September 1, the posts for the new month will be wiped and will be replaced with the ones for the new month.",
      "month": 8,
      "date": 31,
      "year": 2022,
      "id": 21
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 8/31/2022, 11:23 AM.",
      "postContent": "That will be all for today. Thank you all and have a wonderful rest of the day!",
      "month": 8,
      "date": 31,
      "year": 2022,
      "id": 22
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/1/2022, 12:00 AM.",
      "postContent": "Good morning, y'all! This is the new daily announcement that is posted each first day of a new month.",
      "month": 9,
      "date": 1,
      "year": 2022,
      "id": 23
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/1/2022, 12:00 AM.",
      "postContent": "I will continue to maintain this website whenever I make time. That will be it for today's announcements. Thank you all for your patience and have a wonderful rest of the day!",
      "month": 9,
      "date": 1,
      "year": 2022,
      "id": 24
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/5/2022, 10:30 AM.",
      "postContent": "Good morning, y'all! I am here to announce that there has been an update to the progress countdown feature in the \"About Me\" page.",
      "month": 9,
      "date": 5,
      "year": 2022,
      "id": 25
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/5/2022, 10:31 AM.",
      "postContent": "Originally, the progress countdown feature updated every 24 hours. Unfortunately, there were some bugs each time the system would try to recalibrate itself.",
      "month": 9,
      "date": 5,
      "year": 2022,
      "id": 26
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/5/2022, 10:31 AM.",
      "postContent": "For instance, when the time was already 6 AM in the morning, the number of time left was supposed to update back to \"23 hours, 59 minutes, and 59 seconds\". But that did not happen, unfortunately.",
      "month": 9,
      "date": 5,
      "year": 2022,
      "id": 27
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/5/2022, 10:32 AM.",
      "postContent": "Instead, the only that were displayed whenever a user was at the website at that time were a bunch of random negative numbers.",
      "month": 9,
      "date": 5,
      "year": 2022,
      "id": 28
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/5/2022, 10:32 AM.",
      "postContent": "So therefore, instead of relying on the progress countdown feature to update every 24 hours, it will instead be updating each hour.",
      "month": 9,
      "date": 5,
      "year": 2022,
      "id": 29
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/5/2022, 10:34 AM.",
      "postContent": "Now, there will still be bugs, as the system is still pretty new. The percentage increase still works in this new update, as it updates every hour that passes by until it reaches the new percentage that is displayed at 6 AM each day like the previous version.",
      "month": 9,
      "date": 5,
      "year": 2022,
      "id": 30
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/5/2022, 10:37 AM.",
      "postContent": "This will be a test version, and it will be left on this website for about a week to see how it works in the long run. If this version works, then I am keeping it while I continue to make improvements to it.",
      "month": 9,
      "date": 5,
      "year": 2022,
      "id": 31
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/5/2022, 10:38 AM.",
      "postContent": "Anyways, that will be all for today. Have a good Labor Day everyone, and please stay safe!",
      "month": 9,
      "date": 5,
      "year": 2022,
      "id": 32
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/11/2022, 12:48 PM.",
      "postContent": "Hi y'all. I am writing this announcement to let y'all know that I am going to be busy for the next few days, as my focus will be solely placed on school.",
      "month": 9,
      "date": 11,
      "year": 2022,
      "id": 33
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/11/2022, 12:49 PM.",
      "postContent": "In other words, I won't be able to focus that much on maintaining the website. I have to keep up with important upcoming deadlines, in addition to juggling multiple college classes.",
      "month": 9,
      "date": 11,
      "year": 2022,
      "id": 34
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/11/2022, 12:49 PM.",
      "postContent": "Thank you all for your understanding! Have a great rest of the week everyone! Please stay safe!",
      "month": 9,
      "date": 11,
      "year": 2022,
      "id": 35
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/13/2022, 12:13 AM.",
      "postContent": "Good morning, everyone! I understand that it is late right now, but I wanted to share a quick update regarding the progress countdown feature. \n\nAs some of you may know, I updated the way in which the progress bar updates in the \"About Me\" page. Instead of updating itself every day, it will be updating hourly.",
      "month": 9,
      "date": 13,
      "year": 2022,
      "id": 36
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/13/2022, 12:14 AM.",
      "postContent": "It turns out that there were bugs in the ORIGINAL version of the new progress countdown that updates hourly. However, I since have fixed them, and I am happy to say that it working exactly as intended! I will continue to keep an eye on it while I am focusing on college at the moment, in case any bugs arise from it.",
      "month": 9,
      "date": 13,
      "year": 2022,
      "id": 37
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/13/2022, 12:15 AM.",
      "postContent": "That will be all for today. Thank you all for your patience and have a wonderful week y'all! I will return on Monday, September 19th, to continue to maintain this website and provide updates of its status!",
      "month": 9,
      "date": 13,
      "year": 2022,
      "id": 38
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/19/2022, 07:52 PM.",
      "postContent": "Hi y'all! I hope you all had a wonderful weekend!",
      "month": 9,
      "date": 19,
      "year": 2022,
      "id": 39
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/19/2022, 07:53 PM.",
      "postContent": "I am back from my one week absence, and even though this week is busy, I am going to have a bit more time than the week before.",
      "month": 9,
      "date": 19,
      "year": 2022,
      "id": 40
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/19/2022, 07:54 PM.",
      "postContent": "That will be everything for today. Thank you all for your patience and hope you have a wonderful rest of the day, as well as a wonderful evening!",
      "month": 9,
      "date": 19,
      "year": 2022,
      "id": 41
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/29/2022, 01:14 PM.",
      "postContent": "Good afternoon, everyone! I apologize for not providing an announcement for over a week. I got sidetracked by college work and I had to stay on top of everything. Anyways, the reason why I am posting this announcement is to let y'all know that all the announcements for this month will be moved to their archive on October 1 at midnight.",
      "month": 9,
      "date": 29,
      "year": 2022,
      "id": 42
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/29/2022, 01:15 PM.",
      "postContent": "One or two announcements for the upcoming month (October) will be posted and be available when it approaches.",
      "month": 9,
      "date": 29,
      "year": 2022,
      "id": 43
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/29/2022, 01:15 PM.",
      "postContent": "Anyways, I hope you all are having a wonderful week! I will be busy these next couple of weeks so a lot is not going to change.",
      "month": 9,
      "date": 29,
      "year": 2022,
      "id": 44
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/29/2022, 01:17 PM.",
      "postContent": "Before I conclude, I wanted to announce that there has been a change to both the site operation and archival process policies. No significant changes have been made as to how those policies (or rules for that matter) will be implemented for this site. The only thing that has changed is the text to make it more understandable and to ensure that it is up-to-date with where the website is at right now.",
      "month": 9,
      "date": 29,
      "year": 2022,
      "id": 45
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/29/2022, 01:17 PM.",
      "postContent": "Anyways, that will be everything for today. Have a wonderful rest of the week everyone!",
      "month": 9,
      "date": 29,
      "year": 2022,
      "id": 46
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/30/2022, 09:10 PM.",
      "postContent": "Good evening, everyone! I am writing this announcement to let you all know that starting tomorrow exactly at midnight (12 AM), all the announcements for this month will be automatically archived.",
      "month": 9,
      "date": 30,
      "year": 2022,
      "id": 47
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/30/2022, 09:14 PM.",
      "postContent": "Furthermore, the posts for the new month will appear automatically in place of those from the previous month (which in this case, will be September).",
      "month": 9,
      "date": 30,
      "year": 2022,
      "id": 48
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 9/30/2022, 09:15 PM.",
      "postContent": "That will be it for this evening. Thank you all and have a wonderful rest of the weekend! Please stay safe, y'all!",
      "month": 9,
      "date": 30,
      "year": 2022,
      "id": 49
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/1/2022, 12:00 AM.",
      "postContent": "Good morning, y'all. This will be the first announcement for the new month, October!",
      "month": 10,
      "date": 1,
      "year": 2022,
      "id": 50
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/1/2022, 8:33 AM.",
      "postContent": "I just wanted to let y'all know that this month, the ability to change to the Halloween theme will be available from October 15 to November 1.",
      "month": 10,
      "date": 1,
      "year": 2022,
      "id": 51
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/1/2022, 8:33 AM.",
      "postContent": "The reason for doing this is because for this month, I am going to invest more of my time to school and my senior project, which would explain why I decided to introduce the feature at a later date since Halloween festivities are not taken into consideration until the middle of the month.",
      "month": 10,
      "date": 1,
      "year": 2022,
      "id": 52
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/1/2022, 8:33 AM.",
      "postContent": "That will be it for today. Once again, thank you all for your patience, and have a wonderful day and rest of the weekend!",
      "month": 10,
      "date": 1,
      "year": 2022,
      "id": 53
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/4/2022, 05:13 AM.",
      "postContent": "Good morning, y'all! I updated my new profile pic after three months. I hope you enjoy it!",
      "month": 10,
      "date": 4,
      "year": 2022,
      "id": 54
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/10/2022, 03:05 PM.",
      "postContent": "Hi everyone! I want to announce an update in regards to the Halloween themed feature that I announced nearly a week ago.",
      "month": 10,
      "date": 10,
      "year": 2022,
      "id": 55
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/10/2022, 03:07 PM.",
      "postContent": "The Halloween theme feature will be released on October 15. It will automatically be available in the \"Settings\" page and will disappear on November 1 at midnight.",
      "month": 10,
      "date": 10,
      "year": 2022,
      "id": 56
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/10/2022, 03:07 PM.",
      "postContent": "There will be similar themes like the Halloween feature in the future every time there is a holiday.",
      "month": 10,
      "date": 10,
      "year": 2022,
      "id": 57
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/10/2022, 03:08 PM.",
      "postContent": "That will be all for today. Have a great rest of the week, everyone!",
      "month": 10,
      "date": 10,
      "year": 2022,
      "id": 58
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/21/2022, 09:03 PM.",
      "postContent": "Good evening, everyone! I apologize for not posting an announcement for the last week and a half. I have been very busy during that time and am more likely going to be more busy as the new month approaches.",
      "month": 10,
      "date": 21,
      "year": 2022,
      "id": 59
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/21/2022, 09:05 PM.",
      "postContent": "I wanted to reiterate that the new theme appeared on October 15, which was nearly a week ago from today. The theme will be available until November 1st at midnight.",
      "month": 10,
      "date": 21,
      "year": 2022,
      "id": 60
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/21/2022, 09:05 PM.",
      "postContent": "I will be making some bug fixes right now to fix the missing contact form as a result of implementing this theme. I will let you all know when it is fixed!",
      "month": 10,
      "date": 21,
      "year": 2022,
      "id": 61
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/21/2022, 09:11 PM.",
      "postContent": "Just got done fixing the bug where the contact form does not show up as a result of implementing this new theme for the Halloween season!",
      "month": 10,
      "date": 21,
      "year": 2022,
      "id": 62
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/21/2022, 09:13 PM.",
      "postContent": "If there are still issues, please contact me through the form in the \"Contact Me\" page. Thank you all for your patience and have a wonderful rest of the weekend!",
      "month": 10,
      "date": 21,
      "year": 2022,
      "id": 63
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/30/2022, 04:42 PM.",
      "postContent": "Good afternoon, everyone! I wanted to let y'all know that this month's announcements will be moved soon to an archive on November 1st at midnight.",
      "month": 10,
      "date": 30,
      "year": 2022,
      "id": 64
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/30/2022, 04:43 PM.",
      "postContent": "In addition to the archival process, the Halloween theme feature will also disappear on the same day! Make sure that if you have not tried it out yet, feel free to do so before November 1 at midnight.",
      "month": 10,
      "date": 30,
      "year": 2022,
      "id": 65
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 10/30/2022, 04:52 PM.",
      "postContent": "That will be it for today! Thank you all and have a wonderful rest of the weekend, everyone!",
      "month": 10,
      "date": 30,
      "year": 2022,
      "id": 66
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/1/2022, 08:50 AM.",
      "postContent": "Good morning, y'all! This announcement will be the first one for this new month.",
      "month": 11,
      "date": 1,
      "year": 2022,
      "id": 67
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/1/2022, 09:01 AM.",
      "postContent": "I wanted to also take the opportunity to announce a new Thanksgiving theme. The release date for the new theme will be on November 12th.",
      "month": 11,
      "date": 1,
      "year": 2022,
      "id": 68
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/1/2022, 09:01 AM.",
      "postContent": "That will be all for today! Thank you all and have a wonderful rest of the day!",
      "month": 11,
      "date": 1,
      "year": 2022,
      "id": 69
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/8/2022, 08:53 AM.",
      "postContent": "Good morning, everyone! I hope you are all having a wonderful day today!",
      "month": 11,
      "date": 8,
      "year": 2022,
      "id": 70
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/8/2022, 08:54 AM.",
      "postContent": "I wanted to let y'all know that I am going to push the release date of the Thanksgiving theme until November 15th.",
      "month": 11,
      "date": 8,
      "year": 2022,
      "id": 71
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/8/2022, 08:54 AM.",
      "postContent": "The reason for this is because I am a bit preoccupied at the moment with school, and the heavy workload and schedule this week is making it a bit difficult for me to manage this website for the duration of this week.",
      "month": 11,
      "date": 8,
      "year": 2022,
      "id": 72
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/8/2022, 08:55 AM.",
      "postContent": "That will be all for today. Once again, the theme for the Thanksgiving holiday will be released on November 15.",
      "month": 11,
      "date": 8,
      "year": 2022,
      "id": 73
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/8/2022, 08:55 AM.",
      "postContent": "Thank you all and have a wonderful rest of the week!",
      "month": 11,
      "date": 8,
      "year": 2022,
      "id": 74
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/12/2022, 02:26 PM.",
      "postContent": "Hi everyone! I hope you all are having a wonderful weekend! I wanted to make an announcement in regards to the Thanksgiving theme and the \"Settings\" page.",
      "month": 11,
      "date": 12,
      "year": 2022,
      "id": 75
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/12/2022, 02:27 PM.",
      "postContent": "Regarding the Thanksgiving theme, the changes have already been made and will take effect in 3 more days on November 15. After the theme is available at midnight on that same day, you can select the new theme!",
      "month": 11,
      "date": 12,
      "year": 2022,
      "id": 76
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/12/2022, 02:27 PM.",
      "postContent": "However, if you don't happen to see the select option box at all, please click on the \"Clear\" button in the \"Settings\" page. Speaking of the \"Settings\" page...",
      "month": 11,
      "date": 12,
      "year": 2022,
      "id": 77
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/12/2022, 02:29 PM.",
      "postContent": "The user interface for the \"Clear\" and \"Save\" buttons, as well as that of the options box where you can select a different theme, have been updated. I decided to update the style of it to make it a little more appealing for those visiting the website!",
      "month": 11,
      "date": 12,
      "year": 2022,
      "id": 78
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/12/2022, 02:30 PM.",
      "postContent": "That will be everything for today. I will continue to work on this website whenever I have free time from all the homework assignments. Please let me know if you encounter any errors! Thank you all and have a wonderful rest of the weekend!",
      "month": 11,
      "date": 12,
      "year": 2022,
      "id": 79
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/23/2022, 02:54 PM.",
      "postContent": "Hi everyone! Because of Thanksgiving tomorrow, I am going to invoke the \"Holidays\" section of this site's operation policy. Even though I have stated that the website will be closed for a week, I will be making an exception for this case.",
      "month": 11,
      "date": 23,
      "year": 2022,
      "id": 80
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/23/2022, 02:54 PM.",
      "postContent": "The website will instead be closed tomorrow for a full day before reopening tomorrow.",
      "month": 11,
      "date": 23,
      "year": 2022,
      "id": 81
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/23/2022, 02:55 PM.",
      "postContent": "That will be it for today. Please let me know if you have any questions or concerns about anything regarding the operation of the site. Thank you all, and have a wonderful Thanksgiving!",
      "month": 11,
      "date": 23,
      "year": 2022,
      "id": 82
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/27/2022, 03:19 PM.",
      "postContent": "Good afternoon, everyone! I want to let y'all know that the Thanksgiving feature was removed 3 days ago.",
      "month": 11,
      "date": 27,
      "year": 2022,
      "id": 83
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/27/2022, 03:21 PM.",
      "postContent": "The next theme that will be available next month will center around the upcoming Christmas holidays! The release date for the Christmas theme will be on December 16.",
      "month": 11,
      "date": 27,
      "year": 2022,
      "id": 84
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/27/2022, 03:22 PM.",
      "postContent": "In other news, this month's announcements will be archived on the 30th, as per the archive policy set for this site.",
      "month": 11,
      "date": 27,
      "year": 2022,
      "id": 85
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 11/27/2022, 03:22 PM.",
      "postContent": "Thank you all for your patience and I hope you all have a wonderful rest of the weekend!",
      "month": 11,
      "date": 27,
      "year": 2022,
      "id": 86
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/7/2022, 01:58 PM.",
      "postContent": "Hello everyone! I apologize if I did not post the new monthly announcement like I do every first day of the month.",
      "month": 12,
      "date": 7,
      "year": 2022,
      "id": 87
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/7/2022, 01:59 PM.",
      "postContent": "Anyways, I wanted to let you all know that I will be busy for the next week or two due to finals coming up, and most of my focus will have to be put on them.",
      "month": 12,
      "date": 7,
      "year": 2022,
      "id": 88
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/7/2022, 02:00 PM.",
      "postContent": "I will continue to maintain this website as soon as finals are over.",
      "month": 12,
      "date": 7,
      "year": 2022,
      "id": 89
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/7/2022, 02:00 PM.",
      "postContent": "That will be all for today's announcements. Thank you all for your patience, and have a wonderful rest of the week!",
      "month": 12,
      "date": 7,
      "year": 2022,
      "id": 90
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/16/2022, 12:41 PM.",
      "postContent": "Hi everyone! I wanted to let you all know that after a busy couple of weeks, I am now free to continue to maintain this website as usual!",
      "month": 12,
      "date": 16,
      "year": 2022,
      "id": 91
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/16/2022, 12:42 PM.",
      "postContent": "I will keep you all posted to make sure what changes are going to be made in the website in the event that they are implemented.",
      "month": 12,
      "date": 16,
      "year": 2022,
      "id": 92
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/16/2022, 12:44 PM.",
      "postContent": "As of right now, no changes have been announced in regards to the future of this website. The operation of the website will remain the same. However, due to the upcoming holidays, the website will close on December 25th (Christmas) and on New Year's Eve and New Year's (December 31st and January 1st, respectively).",
      "month": 12,
      "date": 16,
      "year": 2022,
      "id": 93
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/16/2022, 12:45 PM.",
      "postContent": "An update will be posted 5 days before the website is due to close on Christmas.",
      "month": 12,
      "date": 16,
      "year": 2022,
      "id": 94
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/16/2022, 12:45 PM.",
      "postContent": "That will be all the announcements for today. If any of you have any questions, please feel free to contact me through the \"Contact Me\" page in the navigation bar above. Thank you all for your patience and have a wonderful rest of the week!",
      "month": 12,
      "date": 16,
      "year": 2022,
      "id": 95
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/19/2022, 11:59 AM.",
      "postContent": "Good afternoon, everyone! I wanted to announce a change that was made to the \"Archives\" page.",
      "month": 12,
      "date": 19,
      "year": 2022,
      "id": 96
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/19/2022, 12:00 PM.",
      "postContent": "As some of you may have noticed, a table has been added to the page. The purpose of this table is to give a better perspective of the dates of when the archive links in the page will expire.",
      "month": 12,
      "date": 19,
      "year": 2022,
      "id": 97
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/19/2022, 12:01 PM.",
      "postContent": "A detail that was also added to the table contains information as to how long the archive link will be available for before it expires on the deadline date.",
      "month": 12,
      "date": 19,
      "year": 2022,
      "id": 98
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/19/2022, 12:01 PM.",
      "postContent": "In case any of you have questions, please feel free to ask through the \"Contact Me\" page!",
      "month": 12,
      "date": 19,
      "year": 2022,
      "id": 99
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/19/2022, 12:01 PM.",
      "postContent": "That will be all for today's announcements. Thank you all and have a wonderful day!",
      "month": 12,
      "date": 19,
      "year": 2022,
      "id": 100
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/22/2022, 11:18 PM.",
      "postContent": "Good evening, everyone! I wanted to announce that the navigation bar has a new look. Compared to its previous user interface, the text in the navigation bar has been capitalized to make it appear modern and appealing to those visiting this website.",
      "month": 12,
      "date": 22,
      "year": 2022,
      "id": 101
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/22/2022, 11:19 PM.",
      "postContent": "In other news, I wanted to let you all know that in the next 3 days, the site will be closing for the Christmas holiday. The site will also close for both New Year's Eve and New Year's.",
      "month": 12,
      "date": 22,
      "year": 2022,
      "id": 102
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/22/2022, 11:20 PM.",
      "postContent": "That will be all the announcements for today. In case you all have questions, please feel free to contact me through the form in the \"Contact Me\" page. In case the website is closed during Christmas and you all have any questions, please feel free to fill out the form and I will get back to you after the holiday is over.",
      "month": 12,
      "date": 22,
      "year": 2022,
      "id": 103
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/22/2022, 11:21 PM.",
      "postContent": "Thank you all for your patience and have a wonderful Merry Christmas!",
      "month": 12,
      "date": 22,
      "year": 2022,
      "id": 104
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/23/2022, 12:10 PM.",
      "postContent": "Good morning, everyone! I wanted to announce that a new Christmas theme has been released today!",
      "month": 12,
      "date": 23,
      "year": 2022,
      "id": 105
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/23/2022, 12:11 PM.",
      "postContent": "I know I said that I was going to release it on December 15th, but unfortunately, due to the circumstances at that time, I was not able to release the theme on time, and I take full responsibility for that.",
      "month": 12,
      "date": 23,
      "year": 2022,
      "id": 106
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/23/2022, 12:15 PM.",
      "postContent": "Going back to the topic of the new Christmas theme, this new feature includes something that was non-existent in previous holiday theme releases.",
      "month": 12,
      "date": 23,
      "year": 2022,
      "id": 107
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/23/2022, 12:16 PM.",
      "postContent": "Whenever a user reloads the page or changes back to the Christmas theme, the latter will change to a random theme. How cool is that?",
      "month": 12,
      "date": 23,
      "year": 2022,
      "id": 108
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/23/2022, 12:17 PM.",
      "postContent": "Because Christmas is right around the corner, this theme will be available until December 26 at midnight.",
      "month": 12,
      "date": 23,
      "year": 2022,
      "id": 109
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/23/2022, 12:18 PM.",
      "postContent": "Anyways, that will be all the announcements for today. Once again, I hope you all have a wonderful Merry Christmas and a Happy New Year!",
      "month": 12,
      "date": 23,
      "year": 2022,
      "id": 110
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/28/2022, 10:39 AM.",
      "postContent": "Hi everyone! I wanted to let you all know that just like what happened in Christmas, the website will be closed from December 31 to January 1, which is around the same time that New Year's Eve and New Year's occur.",
      "month": 12,
      "date": 28,
      "year": 2022,
      "id": 111
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/28/2022, 10:39 AM.",
      "postContent": "The website will re-open on January 2 after the holidays are over.",
      "month": 12,
      "date": 28,
      "year": 2022,
      "id": 112
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/28/2022, 10:40 AM.",
      "postContent": "For the final piece of news, the announcements for this month will be archived on the 31st. The first archive for the new year will be available on February when the announcements for January are automatically archived.",
      "month": 12,
      "date": 28,
      "year": 2022,
      "id": 113
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 12/28/2022, 10:41 AM.",
      "postContent": "That will be all the announcements for today. Thank you all for your patience and have a wonderful New Year's Eve and New Year's! I will see you all on January 2!",
      "month": 12,
      "date": 28,
      "year": 2022,
      "id": 114
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/2/2023, 12:00 AM.",
      "postContent": "Hi everyone! Happy New Year's! This will be the first announcement for this month.",
      "month": 1,
      "date": 2,
      "year": 2023,
      "id": 115
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/2/2023, 12:00 AM.",
      "postContent": "During the 2-day closure of this site, the style of the navigation bar changed slightly. Previously, there was a white border surrounding the name of the current page. With the new change, a gray background box has been implemented to improve the design of the page and the navigation bar.",
      "month": 1,
      "date": 2,
      "year": 2023,
      "id": 116
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/2/2023, 12:00 AM.",
      "postContent": "I hope you all enjoy the new change to the site's navigation bar! If you have any questions, please feel free to use the contact form in the \"Contact Me\" page.",
      "month": 1,
      "date": 2,
      "year": 2023,
      "id": 117
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/2/2023, 12:00 AM.",
      "postContent": "That will be all the announcements for today. Thank you all and have a wonderful rest of the day!",
      "month": 1,
      "date": 2,
      "year": 2023,
      "id": 118
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/9/2023, 02:27 PM.",
      "postContent": "Good afternoon, everyone! I am pleased to announce that a new feature has been rolled out!",
      "month": 1,
      "date": 9,
      "year": 2023,
      "id": 119
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/9/2023, 02:27 PM.",
      "postContent": "Until May 14 midnight, users will have the ability to hide the progress bar feature in the \"About Me\" page if they wish to not see the progress bar.",
      "month": 1,
      "date": 9,
      "year": 2023,
      "id": 120
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/9/2023, 02:28 PM.",
      "postContent": "Again, this feature will only be available until May 14 at 12 AM.",
      "month": 1,
      "date": 9,
      "year": 2023,
      "id": 121
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/9/2023, 02:28 PM.",
      "postContent": "That will be all the announcements for today. Thank you all and have a wonderful rest of the day!",
      "month": 1,
      "date": 9,
      "year": 2023,
      "id": 122
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/16/2023, 12:24 PM.",
      "postContent": "Good afternoon, everyone. I wanted to let y'all know that tomorrow I will be going back to college. I am going to be busy the next couple of weeks adjusting to the dynamic of the new semester in addition to dealing with assignments that will show up during the course of said semester.",
      "month": 1,
      "date": 16,
      "year": 2023,
      "id": 123
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/16/2023, 12:25 PM.",
      "postContent": "I will continue to maintain this website whenever I have the chance. However, I won't be able to maintain the website as frequently as last semester given that I have a major project to complete.",
      "month": 1,
      "date": 16,
      "year": 2023,
      "id": 124
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/16/2023, 12:26 PM.",
      "postContent": "I will continue to post updates whenever I can to let y'all know where I am at during the semester and see whether or not I will be able to make updates to this website.",
      "month": 1,
      "date": 16,
      "year": 2023,
      "id": 125
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/16/2023, 12:26 PM.",
      "postContent": "That will be all for today. Thank you all for your patience and have a wonderful rest of the day!",
      "month": 1,
      "date": 16,
      "year": 2023,
      "id": 126
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/26/2023, 02:51 AM.",
      "postContent": "Good morning, everyone. I wanted to let you all know that an update has been made for the progress countdown feature for my graduation.",
      "month": 1,
      "date": 26,
      "year": 2023,
      "id": 127
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/26/2023, 02:52 AM.",
      "postContent": "My graduation day is a bit earlier in the month than I originally thought, so there is a 1% difference from the original percentage that was displayed a few days ago.",
      "month": 1,
      "date": 26,
      "year": 2023,
      "id": 128
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/26/2023, 02:53 AM.",
      "postContent": "In other news, as the semester has started, I wanted to reiterate that I will be busy during that time, which will give me only a little bit of time to continue maintaining this website.",
      "month": 1,
      "date": 26,
      "year": 2023,
      "id": 129
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/26/2023, 02:54 AM.",
      "postContent": "Anyways, I will continue and try my best to maintain it whenever I do have time. That will be all for today's announcements. Thank you all for your patience and have a wonderful rest of the week!",
      "month": 1,
      "date": 26,
      "year": 2023,
      "id": 130
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/30/2023, 04:41 AM.",
      "postContent": "Good morning, everyone! I wanted to let y'all know that tomorrow is the last day for this month's announcements to be shown in the \"Announcements\" page before they are archived.",
      "month": 1,
      "date": 30,
      "year": 2023,
      "id": 131
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/30/2023, 04:42 AM.",
      "postContent": "In other news, I will be planning for a UI update to this site in the next month or so, depending whether or not I have space on my schedule.",
      "month": 1,
      "date": 30,
      "year": 2023,
      "id": 132
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/30/2023, 04:43 AM.",
      "postContent": "Anyways, I will continue to fill in more details regarding the UI update and let you all know its current progress once I start to work on it.",
      "month": 1,
      "date": 30,
      "year": 2023,
      "id": 133
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/30/2023, 04:43 AM.",
      "postContent": "That will be all of today's announcements. Thank you all for your patience and have a wonderful rest of the day!",
      "month": 1,
      "date": 30,
      "year": 2023,
      "id": 134
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/31/2023, 12:51 PM.",
      "postContent": "Good afternoon, everyone! Today is the last day that this month's announcements will be available before they are wiped from the page completely in favor of the announcements for February.",
      "month": 1,
      "date": 31,
      "year": 2023,
      "id": 135
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 1/31/2023, 12:51 PM.",
      "postContent": "That will be it for today's announcements. I hope you all have a wonderful rest of the day!",
      "month": 1,
      "date": 31,
      "year": 2023,
      "id": 136
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 02/01/2023, 12:00 AM.",
      "postContent": "Hello, everyone! There are two important announcements that I want to make for this month.",
      "month": 2,
      "date": 1,
      "year": 2023,
      "id": 137
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 02/01/2023, 12:00 AM.",
      "postContent": "The first announcement that I want to make is that the development has just started yesterday. I am not sure when the new UI will be available, but more than likely, it will be available in the middle of March.",
      "month": 2,
      "date": 1,
      "year": 2023,
      "id": 138
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 02/01/2023, 12:00 AM.",
      "postContent": "The second announcement I want to make is that I am going to be busy for the remainder of this month while simultaneously improving this website. So please expect a reduction in the number of announcements I make regarding the status of this website.",
      "month": 2,
      "date": 1,
      "year": 2023,
      "id": 139
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 02/01/2023, 12:00 AM.",
      "postContent": "I will keep you all updated whenever I can as my schedule for this month is going to be more packed than last month's. Anyways, that will be all the announcements for today. I will see you all in a few weeks and I hope you have a wonderful rest of the month!",
      "month": 2,
      "date": 1,
      "year": 2023,
      "id": 140
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/9/2023, 05:38 AM.",
      "postContent": "Hi everyone! I wanted to make a quick announcement that the website has been configured to display this month's archive next month.",
      "month": 2,
      "date": 9,
      "year": 2023,
      "id": 141
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/9/2023, 05:38 AM.",
      "postContent": "In addition, regarding the decision of whether I would implement a new user interface for this website, I decided to start on it later this month instead of now.",
      "month": 2,
      "date": 9,
      "year": 2023,
      "id": 142
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/9/2023, 05:39 AM.",
      "postContent": "This is because in the ensuing months, I will have to focus heavily on school, especially on a final project that is a requirement for me to fulfill if I want to graduate on time.",
      "month": 2,
      "date": 9,
      "year": 2023,
      "id": 143
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/9/2023, 05:39 AM.",
      "postContent": "However, I will dedicate most of my time during the spring break, assuming that there is little to no work that week.",
      "month": 2,
      "date": 9,
      "year": 2023,
      "id": 144
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/9/2023, 05:40 AM.",
      "postContent": "I will start to develop the new UI in the middle of the month, most likely in the third week.",
      "month": 2,
      "date": 9,
      "year": 2023,
      "id": 145
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/9/2023, 05:40 AM.",
      "postContent": "That will be all for today's announcements. Thank you all for your understanding and I hope you all have a wonderful rest of the week!",
      "month": 2,
      "date": 9,
      "year": 2023,
      "id": 146
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/16/2023, 07:47 PM.",
      "postContent": "Good evening, everyone. I am happy to announce the development of a new UI is in its initial stages! The development process will most likely take about a month to a month and a half, depending on the circumstances.",
      "month": 2,
      "date": 16,
      "year": 2023,
      "id": 147
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/16/2023, 07:49 PM.",
      "postContent": "I will continue to let y'all know when about the current progress of the new user interface.",
      "month": 2,
      "date": 16,
      "year": 2023,
      "id": 148
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/16/2023, 07:49 PM.",
      "postContent": "Anyways, that will be all for today's announcements. Thank you all and have a wonderful rest of the week!",
      "month": 2,
      "date": 16,
      "year": 2023,
      "id": 149
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/28/2023, 12:25 PM.",
      "postContent": "Good afternoon, everyone. This is just a brief announcement that the announcements for this month will be archived.",
      "month": 2,
      "date": 28,
      "year": 2023,
      "id": 150
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/28/2023, 12:28 PM.",
      "postContent": "New announcements will be posted for the next month as soon as midnight or at 12:30 AM.",
      "month": 2,
      "date": 28,
      "year": 2023,
      "id": 151
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 2/28/2023, 12:28 PM.",
      "postContent": "Anyways, those will be the final announcements for this month. Thank you all and have a wonderful rest of day!",
      "month": 2,
      "date": 28,
      "year": 2023,
      "id": 152
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/1/2023, 12:39 AM.",
      "postContent": "Hi everyone! A couple of announcements I would like to make before starting off the new month.",
      "month": 3,
      "date": 1,
      "year": 2023,
      "id": 153
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/1/2023, 12:40 AM.",
      "postContent": "I'd like to announce that the new UI is under development and is currently in its initial stages. Because of the circumstances, the release date of the new UI will be pushed to April.",
      "month": 3,
      "date": 1,
      "year": 2023,
      "id": 154
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/1/2023, 12:41 AM.",
      "postContent": "Another announcement I'd like to make is about the graduation countdown feature. Since I am already approaching graduation, I thought it would be wise that the countdown feature has only two months left of availability before its expiration date on May 13, 2023.",
      "month": 3,
      "date": 1,
      "year": 2023,
      "id": 155
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/1/2023, 12:42 AM.",
      "postContent": "After that day has passed, the feature will be permanently removed from the site never to be seen again.",
      "month": 3,
      "date": 1,
      "year": 2023,
      "id": 156
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/1/2023, 12:42 AM.",
      "postContent": "Anyways, that will be all the announcements that I will be making for today. Thank you all for your understanding and have a wonderful rest of the week, everyone!",
      "month": 3,
      "date": 1,
      "year": 2023,
      "id": 157
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/10/2023, 07:19 AM.",
      "postContent": "Good morning, guys! I am happy to announce that I have made the first changes to the UI currently under development!",
      "month": 3,
      "date": 10,
      "year": 2023,
      "id": 158
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/10/2023, 07:20 AM.",
      "postContent": "There is still work left to do in changing the UI for the site, as there are still some pages left to go before the release date in April.",
      "month": 3,
      "date": 10,
      "year": 2023,
      "id": 159
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/10/2023, 07:21 AM.",
      "postContent": "I will continue to post updates about the development of the UI as the days go by.",
      "month": 3,
      "date": 10,
      "year": 2023,
      "id": 160
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/10/2023, 07:22 AM.",
      "postContent": "That will be all the announcements for today. Since spring break is happening next week, I will be taking some time off and not make any announcements next week until the following week when I come back to school.",
      "month": 3,
      "date": 10,
      "year": 2023,
      "id": 161
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/10/2023, 07:22 AM.",
      "postContent": "Thank you all for your patience and have a wonderful rest of the week and have a good spring break!",
      "month": 3,
      "date": 10,
      "year": 2023,
      "id": 162
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/14/2023, 06:49 PM.",
      "postContent": "Good evening, everyone! I wanted to share an announcement regarding the status of the website.",
      "month": 3,
      "date": 14,
      "year": 2023,
      "id": 163
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/14/2023, 06:51 PM.",
      "postContent": "I noticed that there were a few errors when I configured the availability for the archive from the past month's announcements.",
      "month": 3,
      "date": 14,
      "year": 2023,
      "id": 164
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/14/2023, 06:51 PM.",
      "postContent": "I already fixed those issues, and I would like to apologize for any inconvenience that this has caused for some of you.",
      "month": 3,
      "date": 14,
      "year": 2023,
      "id": 165
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/14/2023, 06:52 PM.",
      "postContent": "That will be all the announcements for today. Thank you all for your patience and I hope you all have a wonderful spring break! Stay safe, everyone!",
      "month": 3,
      "date": 14,
      "year": 2023,
      "id": 166
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/30/2023, 01:36 PM.",
      "postContent": "Hi everyone! As usual, this month's announcements will on April 1, the first day of the month.",
      "month": 3,
      "date": 30,
      "year": 2023,
      "id": 167
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/30/2023, 01:37 PM.",
      "postContent": "Furthermore, in regards to the UI, I have fallen a bit behind. However, it will still be released in April, but the deadline to release it will be pushed later in the month. As I am focusing on completing my last few courses before I graduate, I am going to be busier than usual.",
      "month": 3,
      "date": 30,
      "year": 2023,
      "id": 168
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/30/2023, 01:38 PM.",
      "postContent": "On top of that, I am also going to focus more on my senior design project since it is a requirement for me to graduate.",
      "month": 3,
      "date": 30,
      "year": 2023,
      "id": 169
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/30/2023, 01:38 PM.",
      "postContent": "That will be all the announcements for today. Thank you all and have a wonderful rest of the month!",
      "month": 3,
      "date": 30,
      "year": 2023,
      "id": 170
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/31/2023, 12:12 PM.",
      "postContent": "Good afternoon, everyone! I wanted to let you all know that today is the last day in which this month's announcements will be available. Starting tomorrow, the 'Announcements' page will be wiped clean, as it occurs every month.",
      "month": 3,
      "date": 31,
      "year": 2023,
      "id": 171
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 3/31/2023, 12:12 PM.",
      "postContent": "Thank you all and have a wonderful rest of the day!",
      "month": 3,
      "date": 31,
      "year": 2023,
      "id": 172
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 4/7/2023, 09:16 PM.",
      "postContent": "Hi guys. I forgot to post the first announcement for the month, but now that I am writing, I would like to share a few updates in regard to the progress of the development of the new UI.",
      "month": 4,
      "date": 7,
      "year": 2023,
      "id": 173
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 4/7/2023, 09:18 PM.",
      "postContent": "So far, I am almost halfway through in making some of the changes needed for the website, such as, for example, changing the color of the form to grey when light theme is implemented in the 'Settings' page, keep the button that shows and hides the progress bar to the current selection instead of resetting back, etc.",
      "month": 4,
      "date": 7,
      "year": 2023,
      "id": 174
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 4/7/2023, 09:20 PM.",
      "postContent": "In addition, I wanted to mention that I am also going to be removing the \"Save\" button from the \"Settings\" page. The reason for this change was due to the fact that it was causing some bugs in the website whenever settings are changed through there. So instead, the changes are going to happen themselves after changing the theme, or deciding to hide or show the progress bar.",
      "month": 4,
      "date": 7,
      "year": 2023,
      "id": 175
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 4/7/2023, 09:21 PM.",
      "postContent": "As of right now, those are the only notable changes that I have made to the new UI, other than a redesign of the home page and the error page, the latter of which applies to both the mobile and web versions.",
      "month": 4,
      "date": 7,
      "year": 2023,
      "id": 176
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 4/7/2023, 09:21 PM.",
      "postContent": "Since the changes are mostly occurring within the web version of the site, the UI for its mobile counterpart will largely remain the same as it was before.",
      "month": 4,
      "date": 7,
      "year": 2023,
      "id": 177
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 4/7/2023, 09:22 PM.",
      "postContent": "Anyways, those are all the announcements I want to make for today. I hope you all have a wonderful Easter weekend and I will see you next week to provide more updates regarding the status of the new UI update!",
      "month": 4,
      "date": 7,
      "year": 2023,
      "id": 178
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/11/2023, 09:28 PM.",
      "postContent": "Hello everyone! It's been a month since I last updated this website, and I have some explaining to do as to what I have been doing during April.",
      "month": 5,
      "date": 11,
      "year": 2023,
      "id": 179
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/11/2023, 09:30 PM.",
      "postContent": "As I've already mentioned a few times, I am a computer engineering student, and am about to be an alumni between tomorrow and next week if I find out that I passed all of my courses.",
      "month": 5,
      "date": 11,
      "year": 2023,
      "id": 180
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/11/2023, 09:31 PM.",
      "postContent": "I have been really busy the entire month of April, as I had a senior design project that I had to work on, and was also a requirement for me to fulfill since  it determined whether I could graduate or not.",
      "month": 5,
      "date": 11,
      "year": 2023,
      "id": 181
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/11/2023, 09:32 PM.",
      "postContent": "Thankfully, with the support of my family, friends, and faculty at the university, I managed to pass the course and meet the requirement needed to graduate!",
      "month": 5,
      "date": 11,
      "year": 2023,
      "id": 182
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/11/2023, 09:34 PM.",
      "postContent": "Because I have been gone for a month, it will take a while for me to set the archives up from April, as I am still updating the UI, as I hadn't had the time to update it because of school. Speaking of which, the progress on the new UI is going great! However, I am going to have to extend the deadline until the beginning of June due to the circumstances during the previous month.",
      "month": 5,
      "date": 11,
      "year": 2023,
      "id": 183
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/11/2023, 09:35 PM.",
      "postContent": "Anyways, that is everything I wanted to share! I hope you all have a wonderful rest of the week and I will continue to update this website starting Monday! Have a great evening, everyone!",
      "month": 5,
      "date": 11,
      "year": 2023,
      "id": 184
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/12/2023, 02:46 PM.",
      "postContent": "Hi guys! I wanted to let you all know that I walked the stage today and am set to graduate! Now that graduation day has passed, the graduation countdown progress feature will be taken down automatically on May 13.",
      "month": 5,
      "date": 12,
      "year": 2023,
      "id": 185
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/12/2023, 02:46 PM.",
      "postContent": "Furthermore, the feature will no longer be available after the deadline has passed.",
      "month": 5,
      "date": 12,
      "year": 2023,
      "id": 186
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/12/2023, 02:47 PM.",
      "postContent": "That will be all the announcements for today. Thank you for all your patience and have a wonderful rest of the day!",
      "month": 5,
      "date": 12,
      "year": 2023,
      "id": 187
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/16/2023, 08:45 AM.",
      "postContent": "Good morning, everyone! As y'all have noticed, a major update was made to the UI. There are still some pages that still look the same, but the changes are evident in the navigation bar, the \"About Me\" page, and the \"Settings\" page, which no longer exists. Speaking of the latter...",
      "month": 5,
      "date": 16,
      "year": 2023,
      "id": 188
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/16/2023, 08:47 AM.",
      "postContent": "I decided to remove the \"Settings\" page entirely. However, the option is still available, as there is only two settings for the website so far, with the clear local storage and theme changer option being the only ones available, as the progress countdown feature had expired three days ago.",
      "month": 5,
      "date": 16,
      "year": 2023,
      "id": 189
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/16/2023, 08:49 AM.",
      "postContent": "The \"Contact Me\" page has been given a makeover as well, though the user interface is almost the same as some things within the page have been switched around.",
      "month": 5,
      "date": 16,
      "year": 2023,
      "id": 190
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/16/2023, 08:50 AM.",
      "postContent": "Furthermore, the \"Contact Me\" page form's character limit has been increased from 300 characters to 500 characters. This decision was made to accommodate any large requests that anyone wants to make regarding the status of this website. However, the same rules that are in the page still apply, as the message cannot be too long and any spam requests or discriminatory/violent messages will be disregarded and discarded immediately.",
      "month": 5,
      "date": 16,
      "year": 2023,
      "id": 191
    },
    {
      "title": "By: Ruben Christopher Arevalo. Posted on 5/16/2023, 08:58 AM.",
      "postContent": "If there any suggestions, please feel free to contact me! That will be all for today. Thank you all and have a wonderful rest of the day!",
      "month": 5,
      "date": 16,
      "year": 2023,
      "id": 192
    }
  ]
}